{"pageProps":{"workData":{"id":"vodafone-uk","contentHtml":"<p>I'm currently working for Vodafone UK. My team is responsibile for My Vodafone Online, where retail customers can login and manage their account.</p>\n<p>We are currently in the process of migrating from the legacy customer portal created ten years ago, to a brand new code base hosted in the cloud and built using the latest technologies. We've completely overhauled the UX to improve the performance and accessibility for our customers.</p>\n<p>There were many issues with the legacy portal application which led to the decision to completely rebuild:</p>\n<ul>\n<li>It was a single code base with little flexibility to optimise customer journeys without aligning to a major quarterly release. This meant it took an average of 12 weeks to deploy front-end changes to production.</li>\n<li>The application was not mobile responsive.</li>\n<li>Page load times were over 4 seconds.</li>\n<li>There was no automated testing in place.</li>\n<li>Overall poor customer experience, with -16 NPS in the billing journey</li>\n</ul>\n<p>Through the new platform we have delivered:</p>\n<ul>\n<li>A mobile-first responsive application.</li>\n<li>Page load times under 2 seconds.</li>\n<li>Code changes deployed to production in less than 30 minutes.</li>\n<li>Improved customer satisfaction (+25 net promoter score in billing journey).</li>\n<li>Automated visual regression tests and end-to-end synthetic tests.</li>\n<li>Recognised in industry awards: ECCCSA - Best Customer Experience Redesign and UK CX awards - Best Digital Transformation.</li>\n</ul>\n<h3>Technologies used</h3>\n<p>React, TypeScript, JavaScript (ES6), Webpack, Vite, Terraform</p>\n<h3>When</h3>\n<p>2021-Present</p>\n<p><img src=\"https://d1nd6ebc4fb67p.cloudfront.net/img/2022/vfuk-account-dashboard.jpeg\" alt=\"Screenshot of Vodafone UK customer account dashboard\"></p>\n","title":"Vodafone UK","date":"2022-10-01","thumbnail":"https://d1nd6ebc4fb67p.cloudfront.net/img/2022/vodafoneuk-thumb.jpg"}},"__N_SSG":true}